robbym/llvm-project/llvm/lib/Target/DSPIC/DSPICMCInstLower.cpp
//===-- DSPICMCInstLower.cpp - Convert DSPIC MachineInstr to an MCInst --===//
//
// Part of the LLVM Project, under the Apache License v2.0 with LLVM Exceptions.
// See https://llvm.org/LICENSE.txt for license information.
// SPDX-License-Identifier: Apache-2.0 WITH LLVM-exception
//
//===----------------------------------------------------------------------===//
//
// This file contains code to lower DSPIC MachineInstrs to their corresponding
// MCInst records.
//
//===----------------------------------------------------------------------===//

#include "DSPICMCInstLower.h"
#include "MCTargetDesc/DSPICMCAsmInfo.h"
#include "llvm/IR/Function.h"
#include "llvm/ADT/SmallString.h"
#include "llvm/CodeGen/AsmPrinter.h"
#include "llvm/CodeGen/MachineBasicBlock.h"
#include "llvm/CodeGen/MachineInstr.h"
#include "llvm/IR/DataLayout.h"
#include "llvm/IR/Mangler.h"
#include "llvm/MC/MCAsmInfo.h"
#include "llvm/MC/MCContext.h"
#include "llvm/MC/MCExpr.h"
#include "llvm/MC/MCInst.h"
#include "llvm/Support/ErrorHandling.h"
#include "llvm/Support/raw_ostream.h"
#include "llvm/Target/TargetMachine.h"
using namespace llvm;

MCSymbol *DSPICMCInstLower::
GetGlobalAddressSymbol(const MachineOperand &MO) const {
  switch (MO.getTargetFlags()) {
  default: llvm_unreachable("Unknown target flag on GV operand");
  case DSPICII::MO_NONE:
  case DSPICII::MO_TBLOFFSET:
  case DSPICII::MO_TBLPAGE:
    break;
  }

  return Printer.getSymbol(MO.getGlobal());
}

MCSymbol *DSPICMCInstLower::
GetExternalSymbolSymbol(const MachineOperand &MO) const {
  switch (MO.getTargetFlags()) {
  default: llvm_unreachable("Unknown target flag on GV operand");
  case DSPICII::MO_NONE:
  case DSPICII::MO_TBLOFFSET:
  case DSPICII::MO_TBLPAGE:
    break;
  }

  return Printer.GetExternalSymbolSymbol(MO.getSymbolName());
}

MCSymbol *DSPICMCInstLower::
GetJumpTableSymbol(const MachineOperand &MO) const {
  const DataLayout &DL = Printer.getDataLayout();
  SmallString<256> Name;
  raw_svector_ostream(Name)
      << DL.getInternalSymbolPrefix() << "JTI" << Printer.getFunctionNumber()
      << '_' << MO.getIndex();

  switch (MO.getTargetFlags()) {
  default: llvm_unreachable("Unknown target flag on GV operand");
  case DSPICII::MO_NONE:
  case DSPICII::MO_TBLOFFSET:
  case DSPICII::MO_TBLPAGE:
    break;
  }

  // Create a symbol for the name.
  return Ctx.getOrCreateSymbol(Name);
}

MCSymbol *DSPICMCInstLower::
GetConstantPoolIndexSymbol(const MachineOperand &MO) const {
  const DataLayout &DL = Printer.getDataLayout();
  SmallString<256> Name;
  raw_svector_ostream(Name)
      << DL.getInternalSymbolPrefix() << "CPI" << Printer.getFunctionNumber()
      << '_' << MO.getIndex();

  switch (MO.getTargetFlags()) {
  default: llvm_unreachable("Unknown target flag on GV operand");
  case DSPICII::MO_NONE:
  case DSPICII::MO_TBLOFFSET:
  case DSPICII::MO_TBLPAGE:
    break;
  }

  // Create a symbol for the name.
  return Ctx.getOrCreateSymbol(Name);
}

MCSymbol *DSPICMCInstLower::
GetBlockAddressSymbol(const MachineOperand &MO) const {
  switch (MO.getTargetFlags()) {
  default: llvm_unreachable("Unknown target flag on GV operand");
  case DSPICII::MO_NONE:
  case DSPICII::MO_TBLOFFSET:
  case DSPICII::MO_TBLPAGE:
    break;
  }

  return Printer.GetBlockAddressSymbol(MO.getBlockAddress());
}

MCOperand DSPICMCInstLower::
LowerSymbolOperand(const MachineOperand &MO, MCSymbol *Sym) const {
  // FIXME: We would like an efficient form for this, so we don't have to do a
  // lot of extra uniquing.
  const MCExpr *Expr = MCSymbolRefExpr::create(Sym, Ctx);

  switch (MO.getTargetFlags()) {
  default: llvm_unreachable("Unknown target flag on GV operand");
  case DSPICII::MO_NONE:
  case DSPICII::MO_TBLOFFSET:
  case DSPICII::MO_TBLPAGE:
    break;
  }

  if (!MO.isJTI() && MO.getOffset())
    Expr = MCBinaryExpr::createAdd(Expr,
                                   MCConstantExpr::create(MO.getOffset(), Ctx),
                                   Ctx);
  return MCOperand::createExpr(Expr);
}

#define GET_REGINFO_ENUM
#include "DSPICGenRegisterInfo.inc"

void DSPICMCInstLower::Lower(const MachineInstr *MI, MCInst &OutMI) const {
  OutMI.setOpcode(MI->getOpcode());

  for (const MachineOperand &MO : MI->operands()) {
    MCOperand MCOp;
    switch (MO.getType()) {
    default:
      MI->print(errs());
      llvm_unreachable("unknown operand type");
    case MachineOperand::MO_Register:
      // Ignore all implicit register operands.
      if (MO.isImplicit()) continue;
      MCOp = MCOperand::createReg(MO.getReg());
      break;
    case MachineOperand::MO_Immediate:
      MCOp = MCOperand::createImm(MO.getImm());
      break;
    case MachineOperand::MO_MachineBasicBlock:
      MCOp = MCOperand::createExpr(MCSymbolRefExpr::create(
                         MO.getMBB()->getSymbol(), Ctx));
      break;
    case MachineOperand::MO_GlobalAddress:
      MCOp = LowerSymbolOperand(MO, GetGlobalAddressSymbol(MO));
      // A function's address as data is `handle(_f)` (L1c): the assembler refuses a
      // bare code symbol there. A call or branch target stays bare.
      if (isa<Function>(MO.getGlobal()) && !MI->getDesc().isCall() &&
          !MI->getDesc().isBranch())
        MCOp = MCOperand::createExpr(
            MCSpecifierExpr::create(MCOp.getExpr(), DSPIC::S_HANDLE, Ctx));
      else if (MO.getTargetFlags() == DSPICII::MO_TBLOFFSET)
        MCOp = MCOperand::createExpr(
            MCSpecifierExpr::create(MCOp.getExpr(), DSPIC::S_TBLOFFSET, Ctx));
      else if (MO.getTargetFlags() == DSPICII::MO_TBLPAGE)
        MCOp = MCOperand::createExpr(
            MCSpecifierExpr::create(MCOp.getExpr(), DSPIC::S_TBLPAGE, Ctx));
      break;
    case MachineOperand::MO_ExternalSymbol:
      MCOp = LowerSymbolOperand(MO, GetExternalSymbolSymbol(MO));
      break;
    case MachineOperand::MO_JumpTableIndex:
      MCOp = LowerSymbolOperand(MO, GetJumpTableSymbol(MO));
      break;
    case MachineOperand::MO_ConstantPoolIndex:
      MCOp = LowerSymbolOperand(MO, GetConstantPoolIndexSymbol(MO));
      break;
    case MachineOperand::MO_BlockAddress:
      MCOp = LowerSymbolOperand(MO, GetBlockAddressSymbol(MO));
      break;
    case MachineOperand::MO_RegisterMask:
      continue;
    }

    OutMI.addOperand(MCOp);
  }
}
